#pragma once

#include "NetVar.h"
#include "C_CSPlayer.h"
#include <stdio.h>
#include <stdint.h>

// from csgo wiki
#define MAX_RANGE 8192.f

// All this stuff is pasted from bspflags.h
// contents flags are seperate bits
// a given brush can contribute multiple content bits
// multiple brushes can be in a single leaf

// these definitions also need to be in q_shared.h!

// lower bits are stronger, and will eat weaker brushes completely
#define	CONTENTS_EMPTY			0		// No contents

#define	CONTENTS_SOLID			0x1		// an eye is never valid in a solid
#define	CONTENTS_WINDOW			0x2		// translucent, but not watery (glass)
#define	CONTENTS_AUX			0x4
#define	CONTENTS_GRATE			0x8		// alpha-tested "grate" textures.  Bullets/sight pass through, but solids don't
#define	CONTENTS_SLIME			0x10
#define	CONTENTS_WATER			0x20
#define	CONTENTS_BLOCKLOS		0x40	// block AI line of sight
#define CONTENTS_OPAQUE			0x80	// things that cannot be seen through (may be non-solid though)
#define	LAST_VISIBLE_CONTENTS	CONTENTS_OPAQUE

#define ALL_VISIBLE_CONTENTS (LAST_VISIBLE_CONTENTS | (LAST_VISIBLE_CONTENTS-1))

#define CONTENTS_TESTFOGVOLUME	0x100
#define CONTENTS_UNUSED			0x200	
// unused 
// NOTE: If it's visible, grab from the top + update LAST_VISIBLE_CONTENTS
// if not visible, then grab from the bottom.
// CONTENTS_OPAQUE + SURF_NODRAW count as CONTENTS_OPAQUE (shadow-casting toolsblocklight textures)
#define CONTENTS_BLOCKLIGHT		0x400


#define PLAYER_FLAG_BITS		11

#define	FL_FLY					(1<<11)	// Changes the SV_Movestep() behavior to not need to be on ground
#define	FL_SWIM					(1<<12)	// Changes the SV_Movestep() behavior to not need to be on ground (but stay in water)
#define	FL_CONVEYOR				(1<<13)
#define	FL_NPC					(1<<14)
#define	FL_GODMODE				(1<<15)
#define	FL_NOTARGET				(1<<16)
#define	FL_AIMTARGET			(1<<17)	// set if the crosshair needs to aim onto the entity
#define	FL_PARTIALGROUND		(1<<18)	// not all corners are valid
#define FL_STATICPROP			(1<<19)	// Eetsa static prop!		
#define FL_GRAPHED				(1<<20) // worldgraph has this ent listed as something that blocks a connection
#define FL_GRENADE				(1<<21)
#define FL_STEPMOVEMENT			(1<<22)	// Changes the SV_Movestep() behavior to not do any processing
#define FL_DONTTOUCH			(1<<23)	// Doesn't generate touch functions, generates Untouch() for anything it was touching when this flag was set
#define FL_BASEVELOCITY			(1<<24)	// Base velocity has been applied this frame (used to convert base velocity into momentum)
#define FL_WORLDBRUSH			(1<<25)	// Not moveable/removeable brush entity (really part of the world, but represented as an entity for transparency or something)
#define FL_OBJECT				(1<<26) // Terrible name. This is an object that NPCs should see. Missiles, for example.
#define FL_KILLME				(1<<27)	// This entity is marked for death -- will be freed by game DLL
#define FL_ONFIRE				(1<<28)	// You know...
#define FL_DISSOLVING			(1<<29) // We're dissolving!
#define FL_TRANSRAGDOLL			(1<<30) // In the process of turning into a client side ragdoll.
#define FL_UNBLOCKABLE_BY_PLAYER (1<<31) // pusher that can't be blocked by the player

// shared/in_buttons.h, use these macros to mask the CUserCmd object (1 means input)
#define IN_ATTACK		(1 << 0)
#define IN_JUMP			(1 << 1)
#define IN_DUCK			(1 << 2)
#define IN_FORWARD		(1 << 3)
#define IN_BACK			(1 << 4)
#define IN_USE			(1 << 5)
#define IN_CANCEL		(1 << 6)
#define IN_LEFT			(1 << 7)
#define IN_RIGHT		(1 << 8)
#define IN_MOVELEFT		(1 << 9)
#define IN_MOVERIGHT	(1 << 10)
#define IN_ATTACK2		(1 << 11)
#define IN_RUN			(1 << 12)
#define IN_RELOAD		(1 << 13)
#define IN_ALT1			(1 << 14)
#define IN_ALT2			(1 << 15)
#define IN_SCORE		(1 << 16)   // Used by client.dll for when scoreboard is held down
#define IN_SPEED		(1 << 17)	// Player is holding the speed key
#define IN_WALK			(1 << 18)	// Player holding walk key
#define IN_ZOOM			(1 << 19)	// Zoom key for HUD zoom
#define IN_WEAPON1		(1 << 20)	// weapon defines these bits
#define IN_WEAPON2		(1 << 21)	// weapon defines these bits
#define IN_BULLRUSH		(1 << 22)
#define IN_GRENADE1		(1 << 23)	// grenade 1
#define IN_GRENADE2		(1 << 24)	// grenade 2
#define	IN_LOOKSPIN		(1 << 25)


#define DEG2RAD(x) ((x/180.0f) * 3.141592653f)

// just like in shareddefs.h
#define HITGROUP_HEAD 1

// ----------------------------------------- GENERAL STRUCTS AND UTILITY ------------------------------------------- //
// if you look in source its just 3 floats
struct Vector
{
    float x, y, z;
    Vector() : x(0), y(0), z(0) {}
    Vector(float x, float y, float z) : x(x), y(y), z(z) {}

    inline Vector& operator=(const Vector& other) {
        this->x = other.x;
        this->y = other.y;
        this->z = other.z;
        return *this;
    }
    inline Vector operator+(const Vector& other) {
        return Vector(this->x + other.x, this->y + other.y, this->z + other.z);
    }
    inline Vector operator-(const Vector& other) {
        return Vector(this->x - other.x, this->y - other.y, this->z - other.z);
    }
    inline Vector operator*(const Vector& other) {
        return Vector(this->x * other.x, this->y * other.y, this->z * other.z);
    }
	inline Vector operator*(const float f) {
		return Vector(this->x * f, this->y * f, this->z * f);
	}
    inline Vector operator*= (float f) {
        x *= f;
        y *= f;
        z *= f;
        return *this;
    }
	inline Vector operator+= (const Vector& other) {
		x += other.x;
		y += other.y;
		z += other.z;
		return *this;
	}
};


bool operator==(const Vector& a, const Vector& b) {
    if (a.x == b.x && a.y == b.y && a.z == b.z) {
        return true;
    }
    else {
        return false;
    }
}

struct VectorAligned {
    float x, y, z, pad; // pad for byte alignment I think
};

// usercmd.h. Since this is actually a class we gotta add the vpointer
struct CUserCmd {

    void* vpointer;

    // For matching server and client commands for debugging
    int		command_number;

    // the tick the client created this command
    int		tick_count;

    // Player instantaneous view angles.
    Vector	viewangles;
    Vector	aimdirection;	// For pointing devices. 
    // Intended velocities
    //	forward velocity.
    float	forwardmove;
    //  sideways velocity.
    float	sidemove;
    //  upward velocity.
    float	upmove;
    // Attack button states
    int		buttons;
    // Impulse command issued.
    uint8_t    impulse;
    // Current weapon id
    int		weaponselect;
    int		weaponsubtype;

    int		random_seed;	// For shared random functions

#ifndef CLIENT_DLL
    int		server_random_seed; // Only the server populates this seed
#endif

    short	mousedx;		// mouse accum in x from create move
    short	mousedy;		// mouse accum in y from create move

    // Client only, tracks whether we've predicted this command at least once
    bool	hasbeenpredicted;

};

inline float clamp(float angle) {
	while (angle < 0) {
		angle += 360.f;
	}
	while (angle > 360) {
		angle -= 360.f;
	}
	return angle;
}

// ----------------------------------------- TYPEDEFS ------------------------------------------- //


typedef void* IHandleEntity;
typedef uint8_t byte;

typedef void kbutton_t;
typedef Vector QAngle;

// from clientmode_shared.cpp:316. We tweak it a bit. This will store the real CreateMove function!
// bool ClientModeShared::CreateMove(float flInputSampleTime, CUserCmd* cmd);
typedef bool(__fastcall* CreateMoveFn)(void* ecx, DWORD edx, float flInputSampleTime, void* cmd);

// from input.h:152
// virtual void		ApplyMouse(int nSlot, QAngle& viewangles, CUserCmd* cmd, float mouse_x, float mouse_y);
typedef bool(__fastcall* ApplyMouseFn)(void* ecx, DWORD edx, int nSlot, QAngle& viewangles, CUserCmd* cmd, float mouse_x, float mouse_y);

// interface.cpp
typedef void* (*CreateInterfaceFn)(const char* pName, int* pReturnCode);
typedef void* matrix3x4_t;


// ----------------------------------------- ENTITYLIST STUFF ------------------------------------------- //

// forward declare some classes that we don't wanna define so we don't get compiler error
// they are big classes.

class IClientUnknown;
class CBaseHandle;
class IClientEntity;


// declare this one because its small
struct EntityCacheInfo_t
{
	// Cached off because GetClientNetworkable is called a *lot*
	IClientNetworkable* m_pNetworkable;
	unsigned short m_BaseEntitiesIndex;	// Index into m_BaseEntities (or m_BaseEntities.InvalidIndex() if none).
	unsigned short m_bDormant;	// cached dormant state - this is only a bit
};

// Legit Entity List (from source)
class IClientEntityList
{
public:
	// Get IClientNetworkable interface for specified entity
	virtual IClientNetworkable* GetClientNetworkable(int entnum) = 0;
	virtual IClientNetworkable* GetClientNetworkableFromHandle(CBaseHandle hEnt) = 0;
	virtual IClientUnknown* GetClientUnknownFromHandle(CBaseHandle hEnt) = 0;

	// NOTE: This function is only a convenience wrapper.
	// It returns GetClientNetworkable( entnum )->GetIClientEntity().
	virtual IClientEntity* GetClientEntity(int entnum) = 0;
	virtual IClientEntity* GetClientEntityFromHandle(CBaseHandle hEnt) = 0;

	// Returns number of entities currently in use
	virtual int					NumberOfEntities(bool bIncludeNonNetworkable) = 0;

	// Returns highest index actually used
	virtual int					GetHighestEntityIndex(void) = 0;

	// Sizes entity list to specified size
	virtual void				SetMaxEntities(int maxents) = 0;
	virtual int					GetMaxEntities() = 0;
	virtual EntityCacheInfo_t* GetClientNetworkableArray() = 0;
};

IClientEntityList* interfaceEntityList;


// A ghetto entity list I derived using ReClass
// Created with ReClass.NET 1.2 by KN4CK3R
class C_BaseEntity
{
public:
	char pad_0000[160]; //0x0000
	Vector position; //0x00A0
	//float xPosition; //0x00A0
	//float yPosition; //0x00A4
	//float zPosition; //0x00A8
	char pad_00AC[72]; //0x00AC
	int32_t	m_iTeamNum;
	int32_t	m_iPendingTeamNum;
	int32_t	m_nNextThinkTick;
	int32_t HEALTH; //0x0100
	int m_fFlags; // 0x104
	float CameraOffset_X; //0x0108
	float CameraOffset_Y; //0x010C
	float CameraOffset_Z; //0x0110
	char pad_0114[24]; //0x0114
	float Pitch; //0x012C
	float Yaw; //0x0130
	float Row; //0x0134
	char pad_0138[36]; //0x0138

public:
	virtual void pad1() = 0;
	virtual void pad2() = 0;
	virtual void pad3() = 0;
	virtual void pad4() = 0;
	virtual IClientNetworkable* GetClientNetworkable() = 0;
}; //Size: 0x015C

class CEntInfo
{
public:
	C_BaseEntity* m_pEntity; //0x0000
	int32_t m_SerialNumber; //0x0004
	CEntInfo* m_pPrev; //0x0008
	CEntInfo* m_pNext; //0x000C
}; //Size: 0x0010

// 64 entities max
class cBaseEntityList
{
public:
	CEntInfo m_EntyPtrArray[64]; //0x0000
	char pad_0400[2096]; //0x0400
}; //Size: 0x0C30


// A class which derives from C_BaseEntity, a little more specific in that it is a player object now
class C_CSPlayer
{
public:

	//// vtable 0x0
	//char pad[0x9C]; // 0x4
	//Vector position;
	//int m_iTeamNum; // 0xF4
	//int m_iPendingTeamNum; // 0xF8
	//int m_nNextThinkTick; // 0xFC
	//int playerHealth; // 0x100
	//int m_fFlags; // 0x104

	// vtable ptr at 0x0
	char pad_0000[156]; //0x0004 (160 = A0 in hex)
	Vector position; //0x00A0
	//float xPosition; //0x00A0
	//float yPosition; //0x00A4
	//float zPosition; //0x00A8
	char pad_00AC[72]; //0x00AC
	int32_t	m_iTeamNum;
	int32_t	m_iPendingTeamNum;
	int32_t	m_nNextThinkTick;
	int32_t playerHealth; //0x0100
	int m_fFlags; // 0x104
	float CameraOffset_X; //0x0108
	float CameraOffset_Y; //0x010C
	float CameraOffset_Z; //0x0110
	char pad_0114[24]; //0x0114
	float Pitch; //0x012C
	float Yaw; //0x0130
	float Row; //0x0134
	char pad_0138[36]; //0x0138

	virtual void sub_103ABC20() = 0;
	virtual void sub_101DC6A0() = 0;
	virtual void sub_101DC6C0() = 0;
	virtual void sub_101A3A90() = 0;
	virtual IClientNetworkable* GetClientNetworkable() = 0;
	virtual void sub_101A3A70() = 0;
	virtual void sub_100BCBF0() = 0;
	virtual void sub_100BCBF0_1() = 0;
	virtual void sub_101A3A60() = 0;
	virtual void sub_101DC2C0() = 0;
	virtual void sub_101DD680() = 0;
	virtual void sub_101DD690() = 0;
	virtual void sub_101C9500() = 0;
	virtual void sub_101E7EF0() = 0;
	virtual void sub_101E3A80() = 0;
	virtual void sub_101E2E50() = 0;
	virtual void sub_1019B680() = 0;
	virtual void sub_103A4F90() = 0;
	virtual void sub_101C4000() = 0;
	virtual void sub_101A6010() = 0;
	virtual void sub_10193F10() = 0;
	virtual void sub_100B6650() = 0;
	virtual void sub_101A69D0() = 0;
	virtual void sub_1019B680_2() = 0;
	virtual void sub_101A6B90() = 0;
	virtual void sub_101A6BA0() = 0;
	virtual void sub_101A6C60() = 0;
